# SetEntity Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..SetEntity Method
Element Class See Also
---
Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetEntity(
	Entity entity
)
```

Visual Basic
---
```text
Public Sub SetEntity ( _
	entity As Entity _
)
```

Visual C++
---
```text
public:
void SetEntity(
	Entity^ entity
)
```

# ### Parameters
entity
    Type: Autodesk.Revit.DB.ExtensibleStorage..::..Entity The Entity to be stored.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Writing of Entities of this Schema is not allowed to the current add-in. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Element Class
Autodesk.Revit.DB Namespace